---- =============================================
-- 使用刚创建的数据库
-- =============================================
use noveltysearch
go

/*==============================================================*/
--插入组织机构根节点
/*==============================================================*/
--delete t_organization
go
insert into t_organization
           (org_pk,
            father_org_pk,
		    first_org_pk,
            father_org_pk_all,
            org_name,
            org_name_short,
            org_type,
            org_classify,
            delete_type,
            create_user_pk,
            create_time)
values     ('00000000-0000-0000-0000-000000000000',
            '-1',
            '00000000-0000-0000-0000-000000000000',
            '-1',
            '特情刑嫌管理',
            '0001',
            '0001',
            0,
            0,
            '00000000-0000-0000-0000-000000000000',
            convert(varchar,Getdate(),120))
go

/*==============================================================*/
--插入超级用户
/*==============================================================*/
--delete t_user
go
insert into t_user
           (
  --主键
  user_pk ,
  --所属组织机构主键
  org_pk,
  --所属一级组织机构主键
  first_org_pk,
  --所有组织机构主键
  all_org_pk,
  --登录名称
  user_login_name,
  --姓名
  user_real_name,
  --性别
  user_sex ,
  --职务名称  注意：全局数据字典
  user_duty_name , 
  --登录密码
  user_password ,
  --所属组织机构分类
  org_classify,
 --创建人组织机构主键
  create_org_pk ,
  --创建人主键
  create_user_pk ,
  --创建时间
  create_time 
)
values     ('00000000-0000-0000-0000-000000000000',
            '00000000-0000-0000-0000-000000000000',
            '00000000-0000-0000-0000-000000000000',
            '00000000-0000-0000-0000-000000000000',
            'admin',
            '超级管理员',
            '0',
            '超级管理员',
            'f6fdffe48c908deb0f4c3bd36c032e72',
            0,
            '00000000-0000-0000-0000-000000000000',
            '00000000-0000-0000-0000-000000000000', 
            convert(varchar,Getdate(),120))
go
/*==============================================================*/
--插入角色
/*==============================================================*/
--delete t_role
go
insert into t_role
values     ('00000000-0000-0000-0000-000000000000',
            '00000000-0000-0000-0000-000000000000',
            '超级管理员角色',
            0,
            '',
            0,
            '00000000-0000-0000-0000-000000000000',
            '00000000-0000-0000-0000-000000000000',
            convert(varchar,Getdate(),120))
/*==============================================================*/
--插入角色-登录用户关联表
/*==============================================================*/
--delete t_user_role
go
insert into t_user_role
values     ('00000000-0000-0000-0000-000000000000',
            '00000000-0000-0000-0000-000000000000',
            '00000000-0000-0000-0000-000000000000',
            0)
go

